leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.LPSPI.h
/*
 * S32K1xx.LPSPI.h
 *
 *  Created on: 2020年7月20日
 *      Author: Master.HE
 */

#ifndef S32K1XX_LPSPI_H_
#define S32K1XX_LPSPI_H_

#include "S32K1xx.Type.h"

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t FEATURE							:16;
		__I  uint32_t MINOR								:8;
		__I  uint32_t MAJOR								:8;
	}BIT;
}LPSPI_VERID_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t TXFIFO							:8;
		__I  uint32_t RXFIFO							:8;
		__I  uint32_t									:16;
	}BIT;
}LPSPI_PARAM_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t MEN								:1;
		__IO uint32_t RST								:1;
		__IO uint32_t DOZEN								:1;
		__IO uint32_t DBGEN								:1;
		__IO uint32_t									:4;

		__IO uint32_t RTF								:1;
		__IO uint32_t RRF								:1;
		__IO uint32_t									:6;

		__IO uint32_t									:16;
	}BIT;
}LPSPI_CR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDF								:1;
		__IO uint32_t RDF								:1;
		__IO uint32_t									:6;

		__IO uint32_t WCF								:1;
		__IO uint32_t FCF								:1;
		__IO uint32_t TCF								:1;
		__IO uint32_t TEF								:1;
		__IO uint32_t REF								:1;
		__IO uint32_t DMF								:1;
		__IO uint32_t									:2;

		__IO uint32_t									:8;

		__IO uint32_t MBF								:1;
		__IO uint32_t									:7;
	}BIT;
}LPSPI_SR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDIE								:1;
		__IO uint32_t RDIE								:1;
		__IO uint32_t									:6;

		__IO uint32_t WCIE								:1;
		__IO uint32_t FCIE								:1;
		__IO uint32_t TCIE								:1;
		__IO uint32_t TEIE								:1;
		__IO uint32_t REIE								:1;
		__IO uint32_t DMIE								:1;
		__IO uint32_t									:2;

		__IO uint32_t									:16;
	}BIT;
}LPSPI_IER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDDE								:1;
		__IO uint32_t RDDE								:1;
		__IO uint32_t									:30;
	}BIT;
}LPSPI_DER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t HREN								:1;
		__IO uint32_t HRPOL								:1;
		__IO uint32_t HRSEL								:1;
		__IO uint32_t									:1;
		__IO uint32_t									:4;

		__IO uint32_t CIRFIFO							:1;
		__IO uint32_t RDMO								:1;
		__IO uint32_t									:6;

		__IO uint32_t									:16;
	}BIT;
}LPSPI_CFGR0_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t MASTER							:1;
		__IO uint32_t SAMPLE							:1;
		__IO uint32_t AUTOPCS							:1;
		__IO uint32_t NOSTALL							:1;
		__IO uint32_t									:1;
		__IO uint32_t									:3;

		__IO uint32_t PCSPOL							:4;
		__IO uint32_t									:4;

		__IO uint32_t MATCFG							:3;
		__IO uint32_t									:5;

		__IO uint32_t PINCFG							:2;
		__IO uint32_t OUTCFG							:1;
		__IO uint32_t PCSCFG							:1;
		__IO uint32_t									:1;
		__IO uint32_t									:3;
	}BIT;
}LPSPI_CFGR1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t SCKDIV							:8;
		__IO uint32_t DBT								:8;
		__IO uint32_t PCSSCK							:8;
		__IO uint32_t SCKPCS							:8;
	}BIT;
}LPSPI_CCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TXWATER							:2;
		__IO uint32_t									:6;

		__IO uint32_t									:8;

		__IO uint32_t RXWATER							:2;
		__IO uint32_t									:6;

		__IO uint32_t									:8;
	}BIT;
}LPSPI_FCR_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t TXCOUNT							:3;
		__I  uint32_t									:5;

		__I  uint32_t									:8;

		__I  uint32_t RXCOUNT							:3;
		__I  uint32_t									:5;

		__I  uint32_t									:8;
	}BIT;
}LPSPI_FSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t FRAMESZ							:12;
		__IO uint32_t									:4;

		__IO uint32_t WIDTH								:2;
		__IO uint32_t TXMSK								:1;
		__IO uint32_t RXMSK								:1;
		__IO uint32_t CONTC								:1;
		__IO uint32_t CONT								:1;
		__IO uint32_t BYSW								:1;
		__IO uint32_t LSBF								:1;

		__IO uint32_t PCS								:2;
		__IO uint32_t									:1;
		__IO uint32_t PRESCALE							:3;
		__IO uint32_t CPHA								:1;
		__IO uint32_t CPOL								:1;
	}BIT;
}LPSPI_TCR_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t SOF								:1;
		__I  uint32_t RXEMPTY							:1;
		__I  uint32_t									:30;
	}BIT;
}LPSPI_RSR_Type;



/* ----------------------------------------------------------------------------
   -- LPSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Peripheral_Access_Layer LPSPI Peripheral Access Layer
 * @{
 */


/** LPSPI - Size of Registers Arrays */

/** LPSPI - Register Layout Typedef */
typedef struct {
	LPSPI_VERID_Type VERID;                             /**< Version ID Register, offset: 0x0 */
	LPSPI_PARAM_Type PARAM;                             /**< Parameter Register, offset: 0x4 */
	uint8_t RESERVED_0[8];
	LPSPI_CR_Type CR;                                /**< Control Register, offset: 0x10 */
	LPSPI_SR_Type SR;                                /**< Status Register, offset: 0x14 */
	LPSPI_IER_Type IER;                               /**< Interrupt Enable Register, offset: 0x18 */
	LPSPI_DER_Type DER;                               /**< DMA Enable Register, offset: 0x1C */
	LPSPI_CFGR0_Type CFGR0;                             /**< Configuration Register 0, offset: 0x20 */
	LPSPI_CFGR1_Type CFGR1;                             /**< Configuration Register 1, offset: 0x24 */
	uint8_t RESERVED_1[8];
	__IO uint32_t DMR0;                              /**< Data Match Register 0, offset: 0x30 */
	__IO uint32_t DMR1;                              /**< Data Match Register 1, offset: 0x34 */
	uint8_t RESERVED_2[8];
	LPSPI_CCR_Type CCR;                               /**< Clock Configuration Register, offset: 0x40 */
	uint8_t RESERVED_3[20];
	LPSPI_FCR_Type FCR;                               /**< FIFO Control Register, offset: 0x58 */
	LPSPI_FSR_Type FSR;                               /**< FIFO Status Register, offset: 0x5C */
	LPSPI_TCR_Type TCR;                               /**< Transmit Command Register, offset: 0x60 */
	__O  uint32_t TDR;                               /**< Transmit Data Register, offset: 0x64 */
	uint8_t RESERVED_4[8];
	LPSPI_RSR_Type RSR;                               /**< Receive Status Register, offset: 0x70 */
	__I  uint32_t RDR;                               /**< Receive Data Register, offset: 0x74 */
} LPSPI_Type, *LPSPI_MemMapPtr;

 /** Number of instances of the LPSPI module. */
#if (defined (__Target_S32K116__))
#define LPSPI_INSTANCE_COUNT                     (1u)
#elif (defined (__Target_S32K118__) || defined (__Target_S32K142__))
#define LPSPI_INSTANCE_COUNT                     (2u)
#elif (defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define LPSPI_INSTANCE_COUNT                     (3u)
#endif

/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI0 base address */
#define LPSPI0_BASE                              (0x4002C000u)
/** Peripheral LPSPI0 base pointer */
#define LPSPI0                                   ((LPSPI_Type *)LPSPI0_BASE)

